robotology/icub-firmware/emBODY/arch-dspic33/apps/others/2foc-icubProto/app/ADC.c
//   
//  ADC related rouines:
//  Measure Current & VDC-Link
//
//  Initialization, control and fault management 
//

#include <p33FJ128MC802.h>
#include <libpic30.h> /*__delay32 */

#include "ADC.h"
#include "Status.h"
#include "Faults.h"

extern tSysError SysError;

#define ADC_VDCLINK_ALLEGRO_MIN_THRESHOLD 120

void ADCInterruptAndDMAEnable(void)
// Enable DMA interrupt, arm DMA for transfer
{
  //Clear the DMA interrupt flag bit
  IFS0bits.DMA0IF = 0; 
  //Set the DMA interrupt enable bit
  IEC0bits.DMA0IE = 1; 
  // amplifiers holding
  AD1CON1bits.SAMP = 1;
  // no valid result is present
  AD1CON1bits.DONE = 0;
  // Clear the A/D interrupt flag bit
  IFS0bits.AD1IF = 0; 
  // Turn on DMA
  DMA0CONbits.CHEN = 1;
  // Turn on A/D module
  AD1CON1bits.ADON = 1;
}

void ADCInterruptAndDMADisable(void)
// Disable DMA interrupt, disarm DMA
{
  // Turn off DMA
  DMA0CONbits.CHEN = 0;
  // Turn off A/D module
  AD1CON1bits.ADON = 0;
  // reset the DMA interrupt enable bit
  IEC0bits.DMA0IE = 0; 
}

SFRAC16 ADCGetVDCLink()
// This quickly returns VDCLink SFRAC value.
{
  return  (ADCBuffer[2]);
}

unsigned int ADCVDCLinkTo100mV(SFRAC16 vadc)
// This return VDC link value in 100mV units.
// It can be used for CAN information message
// or maybe to implement VDClink voltage protection.
// However AdcGetVDCLink() function is faster, so 
// consider using it for voltage protection stuff.
{
  unsigned int tmp;
  double tmp2;

  //convert to full scale unsigned int
  tmp = vadc;
  tmp -= 1<<15;

  // convert to 10 bit unsigned int and mult by 10
  tmp = tmp >> 5;
  tmp *= 5;

  tmp2 = tmp;

  // VonAdcPads = VDC * 0.04592 (from input resistor scaling 100K, 4.7K)
  // AdcReadVal = VDC * 0.04592 / 3.3 * 1024 = 14.249115
  // VDC = AdcReadVal / 14.249115
  // TODO: ....e poi, una divisione con un finto float????
  //   forse sarà il caso di farla in FIXED 1.15 !!!
  tmp2 /= 14.249115; 
  tmp = tmp2 ;
  return (tmp);
}

int ADCCalibrate(void)
// Calculate mean value of ADC_CAL_N_SAMPLES samples for iA, iB and Vdc and store in
// MeasCurrParm.Offseta, Offsetb 
// DMA AND ADC isr are not enabled here!
// An error in estimation of current offset results in a cogging torque when 
// torque set point is 0; the value can be adjusted looking at the 3 phase ia, ib, and ic
// and centering all values around 0
{
  int i,TOT;
  long ADCVdcZero = 0;
  long ADCOffs1 = 0, ADCOffs2 = 0;
  
  // Put an 'accettable' value in case of error in the calibration process
  MeasCurrParm.Offseta = 0x200;
  MeasCurrParm.Offsetbc = 0x200;

  // Turn on ADC module
  AD1CON1bits.ADON = 1;
 	
  for(i=0;i<ADC_CAL_N_SAMPLES;i++)
  {
    // samples AN0
    AD1CHS0bits.CH0SA = 0;
    AD1CON1bits.DONE = 0;
    // amplifiers holding
    AD1CON1bits.SAMP = 1;

    // TODO: TRIM ME (eventually:)
    __delay32(100);

    // convert!
    AD1CON1bits.SAMP = 0;

    // init time out timer
    TOT=0;
    // poll for end of conversion
    while( 0 == AD1CON1bits.DONE)
    {
      // Avoids polling lock
      if (ADC_CAL_TIMEOUT == ++TOT)
      {
        // offset correction error signaling 
      
        return -1;
      }
    }
    // accumulate values
    ADCOffs1 += ADC1BUF0;

    // Samples AN1
    AD1CHS0bits.CH0SA = 1;
		
    AD1CON1bits.DONE = 0;
    // amplifiers holding
    AD1CON1bits.SAMP = 1;

    // TODO TRIM ME
    __delay32(100);

    // convert!
    AD1CON1bits.SAMP = 0;

    // init time out timer
    TOT=0;
    // poll for end of conversion
    while( 0 == AD1CON1bits.DONE )
    {
      // Avoids polling lock
      if (ADC_CAL_TIMEOUT == ++TOT)
      {
        // offset correction error signaling 
   
        return -1;
      }
    }
    // accumuulate values
    ADCOffs2 += ADC1BUF0;
	
    // Samples AN2 (Vdc)
    AD1CHS0bits.CH0SA = 2;

    AD1CON1bits.DONE = 0;
    // amplifiers holding
    AD1CON1bits.SAMP = 1;

    // TODO TRIM ME */
    __delay32(100);

    // convert!
    AD1CON1bits.SAMP = 0;
    // don't mind about int generated

    // init time out timer
    TOT=0;
    // poll for end of conversion
    while( 0 == AD1CON1bits.DONE )
    {
      // Avoids polling lock
      if (ADC_CAL_TIMEOUT == ++TOT)
      {
        // offset correction error signaling 
   
        return -1;
      }
    }
    // accumuulate values
    ADCVdcZero += ADC1BUF0;

   /* if the measured VDCLINK is lower than this threshold
    * then we cannot be sure the Allegro are properly powered.
    * For this reason the ADC calibration is not reliable.
    */
    if(ADCVDCLinkTo100mV(ADC1BUF0) < ADC_VDCLINK_ALLEGRO_MIN_THRESHOLD)
	 return -2;
  }

  // divide for number of samples in order to get mean
  ADCOffs1 /= ADC_CAL_N_SAMPLES;
  ADCOffs2 /= ADC_CAL_N_SAMPLES;
  ADCVdcZero /= ADC_CAL_N_SAMPLES;



  // associate the calculated offset
  MeasCurrParm.Offseta = ADCOffs1;
  MeasCurrParm.Offsetbc = ADCOffs2;

// TODO: mettere a posto la correzione dell'offset
//   e quindi togliere questi bypass!
//MeasCurrParm.Offseta = 0x200;
//MeasCurrParm.Offsetbc = 0x200;

// TODO: un commentino, no?
  TargetDCbus = ADCVdcZero;

  // Turn off ADC module
  AD1CON1bits.ADON = 0;

  return 0;
}

void ADCConfigPWMandDMAMode()
// Confure ADC regisaters for PWM sync and DMA transfer
{
  // zero configuration 
  AD1CON1 = 0;
  AD1CON2 = 0;
  AD1CON3 = 0;
  
  // 10 bits
  AD1CON1bits.AD12B = 0;
  
  // A/D Conversion Clock (TAD). must be >= 75ns.
  // 40Mhz clk = 25 ns (TCY).
  // TAD = TCY * (ADCS+1)
  // TAD = 25*3 = 75 ns
  // Conversion time = TAD*12 = 900ns 
// TODO: il valore di conversione ha influenza sul ritardo con cui parte il calcolo della SVG 
// 0.9ns + tempo di calcolo deve essere < di TPWM/2  
  // AM portato a 4. Empiricamente si vede meno rumore su DCLink.
  // Su lettura di corrente sembra migliorare leggermente
  AD1CON3bits.ADCS = 4;   // AD1CON3bits.ADCS = 2;  

  // Samples CH0, CH1, CH2, CH3 simultaneously (when CHPS = 1x)
  AD1CON2bits.CHPS = 2;  

  // Samples multiple channels simultaneous
  AD1CON1bits.SIMSAM = 1; 

  // Sampling begins immediately after last conversion completes. 
  // SAMP bit is auto set
  AD1CON1bits.ASAM = 1;  

  // PWM triggered conversion
  AD1CON1bits.SSRC = 3; 

  // Signed fractional (DOUT = sddd dddd dd00 0000)
  AD1CON1bits.FORM = 3;    

  // Interrupt after every conversion!
  AD1CON2bits.SMPI = 0;
   
  // One sample per cycle on each ch
  AD1CON4 = 0;
    
  // Do not scan!
  AD1CON2bits.CSCNA = 0;

  // ADCHS: ADC Input Channel Select Register
  AD1CHS0 = 0;
	
  // CH0 is unused. connect to a dummy AN
  AD1CHS0bits.CH0SA = 3;
  // CH1 positive input is AN0, CH2 positive input is AN1, CH3 positive input is AN2
  AD1CHS123bits.CH123SA = 0;

  // DMA configurations for ADC
  DMA0CON = 0;
  // Configure DMA for Peripheral indirect mode
  DMA0CONbits.AMODE = 2;

  // Continuous, Ping-Pong modes disabled
  DMA0CONbits.MODE = 0;

  // trasfer block unit is a WORD
  DMA0CONbits.SIZE = 0;

  // set DMA source register	
  DMA0PAD=(int)&ADC1BUF0;
  // number of words to transfer
  // do 4 transfers
  DMA0CNT = 3;
  // attach DMA0 transfer to ADC
  DMA0REQ = 13;

  // set address of dma buffer    
  DMA0STA = __builtin_dmaoffset(ADCBuffer);
}

void ADCConfigureRegistersForCalibration()
// Configure ADC registers for calibration without PWM sync and DMA
{
  // zero configuration 
  AD1CON1 = 0;
  AD1CON2 = 0;
  AD1CON3 = 0;
    
  // A/D Conversion Clock Select bits = 21 * Tcy
  AD1CON3bits.ADCS = 20;

  // sample only from ch0 
  AD1CON2bits.CHPS = 0;  

  // Samples multiple channels individually in sequence
  AD1CON1bits.SIMSAM = 0; 

  // Sampling begins immediately after last conversion completes. 
  // SAMP bit is auto set
  AD1CON1bits.ASAM = 1;  

  // sampling in manual mode
  AD1CON1bits.SSRC = 0; 

  // Signed fractional (DOUT = sddd dddd dd00 0000)
  AD1CON1bits.FORM = 3;    

  // Interrupt after every conversion!
  AD1CON2bits.SMPI = 0;
   
  // One sample per cycle on each ch
  AD1CON4 = 0;
    
  // Do not scan for calibration !
  AD1CON2bits.CSCNA = 0;

  // Channel 0 negative input is VREF-
  AD1CHS0 = 0; 	
}

void ADCDoOffsetCalibration(void)
// ADC Initialization:
// Performs offset calibration for ISENSES and initial base value acquisition for vdclink.
// Then setup ADC for for sequential sampling on  CH0=AN0, CH1=AN1, CH2=AN2. 
// without PWM sync and DMA, value and stored in MeasCurrParm.Offseta,b signed fractional form.
{
  int ret;
  // Configure ADC registers for calibration without PWM sync and DMA
  ADCConfigureRegistersForCalibration();

  // Execute calibration and store values
  while(1){
	ret = ADCCalibrate() ;

    if(-1 == ret){

		/* AD is not working properly.
         * loop forever if fatal error
         * condition
         */
		 SysError.ADCCalFailure = 1;
		 LED_status.RedBlinkRate=BLINKRATE_STILL;

 		 while(1);    

	}else if(-2 == ret){
    	
		/* VDCLink is too low.
         * enlight red led, then
         * wait forever for VDClink to
         * raise 
         */ 
		SysError.ADCCalFailure = 1;
	//	LED_status.RedBlinkRate=BLINKRATE_STILL;
        break;
		
        //continue;
 	}
		 
  //	LED_status.RedBlinkRate=BLINKRATE_OFF;
 	 

  return;
  }
  
}
